#  Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# Пример:

# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

list = [1,2,3,4,5,6,7,8,9,10]
sum = 0
print(list)

for i in list: 

    if (i%2) == 0:

        sum += i

print(f"Сумма элементов на нечётных позициях равна {sum}" )
